#pragma once
#include <SFML/Graphics.hpp>	//бібліотека для роботи з 2D графікою

using namespace sf;				//використовуємо прстір імен sf для роботи з бібліотеками SFML

class Entity {
private: float x, y;
public:
	int point;															//кількість очків які добавляться гравцю
	float w, h, dy;														//ширина, висота і прискорення ворога
	String File;														//назва файлу в якому зберігається зображення тексури
	Image image;														//саме зобрадення текстури
	Texture texture;													//текстура
	Sprite sprite;														//тексура "натянута" на прямокутник
	Entity(String F, float X, float Y, float W, float H)				//приймаємо назву файла з зображенням текстури, початкове розташування та розміри ворога
	{
		dy = 0.04;														//початкове прискорення
		File = F;														//прийняте ім'я файла з зображенням текстури
		w = W; h = H;													//розміри прямокутника на який буде "натянута" текстура
		x = X; y = Y;													//початкові координати
		image.loadFromFile("images/" + File);					//завантажуємо зображення в змінну для подальшого використання	
		image.createMaskFromColor(Color(255, 255, 255));	//робимо фільтр щоб білий фон зображення став прозорим
		texture.loadFromImage(image);									//присвоюєму текстурі її зобження
		sprite.setTexture(texture);										//"натягуєму" текстуру на проекцію
	}
	void update(float time)
	{
		point = 0;														//обнудення змінної
		y += dy * time;		//прискорення помножене на час\\			//нова координата ворога

		sprite.setPosition(x, y);										//виводимо спрайт в позицію x y, по центру. нескінченно виводимо в цій функції, інакше б наш спрайт стояв би на місці.
		check_leave();													//перевірка на вихід за межі карти
	}
	//тут все зрозуміло :-)//
	float get_enemy_coordinate_x() {
		return x;
	}
	float get_enemy_coordinate_y() {
		return y;
	}
	//віддаємо координати та розміри ворога для подальшої перевірки на зіткнення з гравцем//
	FloatRect getRect() {
		return FloatRect(x, y, w, h);
	}
	//перевірка на вихід ворога за межі карти//
	void check_leave()
	{
		if (y > 580)													//якщо межу переткнуто, то
		{
			auto i = 0;
			i = rand() % 5;												//випадково вибираємо наступну полосу по якій буде переміщатися ворог
			{
				if (i == 0)
				{
					x = 50;
				}
				if (i == 1)
				{
					x = 100;
				}
				if (i == 2)
				{
					x = 150;
				}
				if (i == 3)
				{
					x = 200;
				}
				if (i == 4)
				{
					x = 250;
				}
			}

			y = -150;													//ставляємо його вверх
			sprite.setPosition(x, y);									//приміняємо нові координати

			point++;													//додаємо одне очко гравцю
			dy += 0.01;													//збільшуємо швидкість ворога
		}
	}
};